import pandas as pd
import random

# Список стран
countries = ['Китай', 'Индия', 'Турция', 'ОАЭ', 'Саудовская Аравия', 'Египет', 'Бразилия', 'ЮАР', 'Иран', 'Аргентина', 'Мексика', 'Индонезия', 'Пакистан', 'Таиланд', 'Вьетнам', 'Казахстан', 'Узбекистан', 'Киргизия', 'Азербайджан', 'Армения', 'Сербия', 'Венесуэла', 'Куба', 'Беларусь', 'Сирия', 'Никарагуа', 'Бангладеш', 'Мьянма', 'Эфиопия', 'Алжир']
regimes = ['Импорт','Экспорт']
# Загрузка файла
df = pd.read_csv('ml-model/goods.csv')

# Добавляем случайную страну
df['country'] = [random.choice(countries) for _ in range(len(df))]

# Сопоставление стран и валют
country_to_currency = {
    'Китай': 'CNY',
    'Индия': 'INR',
    'Турция': 'TRY',
    'ОАЭ': 'AED',
    'Саудовская Аравия': 'SAR',
    'Египет': 'EGP',
    'Бразилия': 'BRL',
    'ЮАР': 'ZAR',
    'Иран': 'IRR',
    'Аргентина': 'ARS',
    'Мексика': 'MXN',
    'Индонезия': 'IDR',
    'Пакистан': 'PKR',
    'Таиланд': 'THB',
    'Вьетнам': 'VND',
    'Казахстан': 'KZT',
    'Узбекистан': 'UZS',
    'Киргизия': 'KGS',
    'Азербайджан': 'AZN',
    'Армения': 'AMD',
    'Сербия': 'RSD',
    'Венесуэла': 'VES',
    'Куба': 'CUP',
    'Беларусь': 'BYN',
    'Сирия': 'SYP',
    'Никарагуа': 'NIO',
    'Бангладеш': 'BDT',
    'Мьянма': 'MMK',
    'Эфиопия': 'ETB',
    'Алжир': 'DZD'
}
# Применяем маппинг
df['currency'] = df['country'].map(country_to_currency)

# Сохраняем обратно
df.to_csv("goods.csv", index=False)
